Revit 2027 API
Outline.Contains Method
 Determine if this Outline contains the specified point to within a tolerance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	XYZ point,
	double tolerance
)
Public Function Contains (
	point As XYZ,
	tolerance As Double
) As Boolean
public:
bool Contains(
	XYZ^ point,
	double tolerance
)
member Contains :
        point : XYZ *
        tolerance : float -> bool
Parameters
point XYZ
 The point to test for containment.
tolerance Double
 The tolerance to use when determining whether the point is contained. Defaults to zero.
Return Value
Boolean
 True if this outline contains the given point, or false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the tolerance is positive, the point may lie up to the tolerance amount outside the outline in each coordinate. If the tolerance is negative, the point must lie at least the tolerance amount inside the outline in each coordinate.
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace